# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [9]:
cur.execute("""SELECT firstName, lastName
            FROM employees
            JOIN offices
            USING(officeCode)
            WHERE city = 'Boston'
            """)
boston_employees = pd.DataFrame(cur.fetchall())
boston_employees.columns = [x[0] for x in cur.description]
boston_employees

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [14]:
cur.execute("""SELECT officeCode, city
            FROM offices
            JOIN employees
            USING(officeCode)
            GROUP BY city
            HAVING COUNT(employeeNumber) = 0;
            """)
zero_emp_offices = pd.DataFrame(cur.fetchall())
print(f'Number of offices w/ zero employees: {len(zero_emp_offices)}')

Number of offices w/ zero employees: 0

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [32]:
# 5 worst employees by number of customers served
cur.execute("""SELECT firstName, lastName, COUNT(customerNumber)
            FROM employees 
            JOIN customers 
            ON employeeNumber = salesRepEmployeeNumber
            GROUP BY employeeNumber
            ORDER BY COUNT(customerNumber)
            LIMIT 5;
            """)
least_customers = pd.DataFrame(cur.fetchall())
least_customers.columns = [x[0] for x in cur.description]
least_customers

  firstName  lastName  COUNT(customerNumber)
0      Andy    Fixter                      5
1     Peter     Marsh                      5
2      Mami     Nishi                      5
3    Leslie  Jennings                      6
4    Leslie  Thompson                      6

In [29]:
# Give the 5 worst employees by number of orders
cur.execute("""SELECT firstName, lastName, COUNT(orderNumber)
            FROM employees e
            JOIN customers c
            ON e.employeeNumber = c.salesRepEmployeeNumber
            JOIN orders
            USING(customerNumber)
            GROUP BY employeeNumber
            ORDER BY COUNT(orderNumber)
            LIMIT 5;
            """)
worst_5_sellers = pd.DataFrame(cur.fetchall())
worst_5_sellers.columns = [x[0] for x in cur.description]
worst_5_sellers

  firstName  lastName  COUNT(orderNumber)
0    Martin    Gerard                  12
1    Leslie  Thompson                  14
2     Julie  Firrelli                  14
3      Mami     Nishi                  16
4  Foon Yue     Tseng                  17

In [24]:
# Give the 5 worst employees by sales in $
cur.execute("""SELECT firstName, lastName, SUM(amount)
            FROM employees
            JOIN customers
            ON employeeNumber = salesRepEmployeeNumber
            JOIN payments
            USING(customerNumber)
            GROUP BY employeeNumber
            ORDER BY SUM(amount)
            LIMIT 5;
            """)
least_money_employees = pd.DataFrame(cur.fetchall())
least_money_employees.columns = [x[0] for x in cur.description]
least_money_employees

  firstName   lastName  SUM(amount)
0    Leslie   Thompson    347533.03
1     Julie   Firrelli    386663.20
2    Martin     Gerard    387477.47
3     Steve  Patterson    449219.13
4      Mami      Nishi    457110.07

## Level Up: Display the names of every individual product that each employee has sold

In [21]:
cur.execute("""SELECT firstName, lastName, productName
            FROM employees e
            JOIN customers c
            ON e.employeeNumber = c.salesRepEmployeeNumber
            JOIN orders o
            USING(customerNumber)
            JOIN orderdetails od
            USING(orderNumber)
            JOIN products p
            USING(productCode);
            """)
employees_and_products = pd.DataFrame(cur.fetchall())
employees_and_products.columns = [x[0] for x in cur.description]
employees_and_products.head()

  firstName  lastName                                  productName
0    Leslie  Jennings                               1958 Setra Bus
1    Leslie  Jennings                       1940 Ford Pickup Truck
2    Leslie  Jennings                      1939 Cadillac Limousine
3    Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4    Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each employee has sold

In [25]:
cur.execute("""SELECT firstName, lastName, COUNT(productName)
            FROM employees e
            JOIN customers c
            ON e.employeeNumber = c.salesRepEmployeeNumber
            JOIN orders o
            USING(customerNumber)
            JOIN orderdetails od
            USING(orderNumber)
            JOIN products p
            USING(productCode)
            GROUP BY employeeNumber;
            """)
employees_num_sold = pd.DataFrame(cur.fetchall())
employees_num_sold.columns = [x[0] for x in cur.description]
employees_num_sold.head()

  firstName   lastName  COUNT(productName)
0    Leslie   Jennings                 331
1    Leslie   Thompson                 114
2     Julie   Firrelli                 124
3     Steve  Patterson                 152
4  Foon Yue      Tseng                 142

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!